import React from 'react'
import { useSelector } from 'react-redux'
import { getLanguage } from '../../redux/selectors/languageSelector'
import './AboutUs.scss'

export default function AboutUs() {
  const language = useSelector(getLanguage);

  return (
    <div className='aboutUs'>
      <div className="container">
        <div className="aboutUs__content">
          {
            language === 'RU' ?
              `Burgerim – это сочные мини бургеры оформлены в сеты для Вашего удобства. Почему наши бургеры такие вкусные? Наш секрет – это свежие продукты, эксклюзивная рецептура котлет и наша любовь к приготовлению бургеров. Весь процесс обжарки котлет проходит на мангале, что придает пикантный аромат бургерам Burgerim.
              Мы совершенно новый, эксклюзивный формат бургеров в Одессе.`
              :
              `Burgerim - це соковиті міні бургери оформлені в сети для Вашої зручності. Чому наші бургери такі смачні? Наш секрет - це свіжі продукти, ексклюзивна рецептура котлет і наша любов до приготування бургерів. Весь процес обсмажування котлет проходить на мангалі, що додає пікантний аромат бургерам Burgerim.
              Ми абсолютно новий, ексклюзивний формат бургерів в Одесі.`
          }
        </div>
        <div className="aboutUs__content">
          <h2 className="aboutUs__list-title">{language === 'RU' ? 'Выберите:' : 'Оберіть:' }</h2>
          <ul className="aboutUs__list">
            <li className="aboutUs__list-item">
              {language === 'RU' ? 'Burgerim диетический для детей с индейкой в школу.' : 'Burgerim дієтичний для дітей з індичкою в школу.' }
              
            </li>
            <li className="aboutUs__list-item">
              {language === 'RU' ? 'Сытные бургеримы со свининой для обеденного перерыва в офис.' : 'Ситні бургеріми зі свининою для обідньої перерви в офіс.' }
            </li>
            <li className="aboutUs__list-item">
              {language === 'RU' ? 'Сет из 16 бургеримов с телятиной на всю семью для пикника или в дорогу.' : 'Сет з 16 бургерімов з телятиною на всю сім\'ю для пікніка або в дорогу.' }
              
            </li>
          </ul>
        </div>
        <div className="aboutUs__content">
          {language === 'RU' ?
           `У нас каждый найдет бургер по своему вкусу и количеству. Быстрая доставка Burgerim привезет Вам Ваш любимый сет в любую точку Одессы. Желаете чего-то необычного? Оставляйте заявку на сайте,
           и наш оператор свяжется с Вами или позвоните нам, и закажите быструю доставку бургеров домой, в офис или на природу.` 
           : 
           `У нас кожен знайде бургер на свій смак і кількості. Швидка доставка Burgerim привезе Вам Ваш улюблений сет в будь-яку точку Одеси. Бажаєте чогось незвичайного? Залишайте заявку на сайті,
           і наш оператор зв'яжеться з Вами або зателефонуйте нам, і замовте швидку доставку бургерів додому, в офіс або на природу.`
          }
      </div>
      </div>

    </div>
  )
}
